<html>
<head>
 <title>Компьютерные системы - Нечёткие процессоры</title>
 <META http-equiv=Content-Type content="text/html; charset=Windows-1251">
 <META name=GENERATOR   content="SunRav BookEditor" >
 <META name=keywords    content="">
 <META name=description content="Нечёткие процессоры">
 <link rel="stylesheet" href="styles.css" type="text/css">
</head>
<body style="background: url(back_66.jpg)">
<!-- Generated by SunRav BookOffice -->
 <table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
   <td valign="top">
    
<p><img border=0 width=572 height=130 alt="" hspace=1 vspace=1 src="img/img_0.jpg"><span class=rvts20> </span></p>

    
<p><span class=rvts61>&#1053;&#1077;&#1095;&#1105;&#1090;&#1082;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099;</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1042; 1986 &#1075;&#1086;&#1076;&#1091; &#1074;&nbsp;</span><span class=rvts60>AT and T Bell Labs</span><span class=rvts58>&nbsp;&#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099; &#1089; "&#1087;&#1088;&#1086;&#1096;&#1080;&#1090;&#1086;&#1081;" &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1081; &#1083;&#1086;&#1075;&#1080;&#1082;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1042; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; 90-&#1093; &#1082;&#1086;&#1084;&#1087;&#1072;&#1085;&#1080;&#1103;&nbsp;</span><span class=rvts60>Adaptive Logic</span><span class=rvts58>&nbsp;&#1080;&#1079; &#1057;&#1064;&#1040; &#1074;&#1099;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083;&#1072; &#1082;&#1088;&#1080;&#1089;&#1090;&#1072;&#1083;&#1083;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;-&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080;. &#1054;&#1085; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1089;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1089;&#1088;&#1086;&#1082;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1074; &#1089;&#1086;&#1073;&#1086;&#1081; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1089;&#1093;&#1077;&#1084;&#1099; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1080;&#1093; &#1084;&#1080;&#1082;&#1088;&#1086;&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1086;&#1074;.&nbsp;</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1081; &#1083;&#1086;&#1075;&#1080;&#1082;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1086;&#1082;&#1086;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1090; &#1080;&#1093; &#1074; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1079;&#1072;&#1090;&#1077;&#1084;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;, &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1081; &#1083;&#1086;&#1075;&#1080;&#1082;&#1080; &#1080; &#1076;&#1072;&#1083;&#1077;&#1077; &#8211; &#1074; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;. &#1042;&#1089;&#1077; &#1101;&#1090;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1080; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1073;&#1099; &#1090;&#1086; &#1085;&#1080; &#1073;&#1099;&#1083;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1081; &#1083;&#1086;&#1075;&#1080;&#1082;&#1080;.&nbsp;</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1069;&#1090;&#1086;&#1090; &#1084;&#1080;&#1082;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1075;&#1088;&#1086;&#1084;&#1086;&#1079;&#1076;&#1082;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084;&#1080; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1053;&#1086; &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1091; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1081;/&#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1081; &#1082;&#1088;&#1080;&#1089;&#1090;&#1072;&#1083;&#1083;, &#1086;&#1085; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1085;&#1072; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1099;&#1089;&#1086;&#1082;&#1080;&#1093; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1103;&#1093;&nbsp;</span><span class=rvts60>(&#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1086;&#1090;&#1089;&#1095;&#1077;&#1090;&#1086;&#1074; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#8211; 10 &#1082;&#1043;&#1094;, &#1072; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1089;&#1095;&#1077;&#1090;&#1072; &#8211; 500 &#1090;&#1099;&#1089;. &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;/&#1089;)</span><span class=rvts58>, &#1095;&#1090;&#1086; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1083;&#1091;&#1095;&#1096;&#1080;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;&#1084; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080;, &#1085;&#1086; &#1084;&#1077;&#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1084;&#1080;.</span></p>
<p><img border=0 width=608 height=808 alt="" hspace=1 vspace=1 src="img/img_119.jpg"></p>
<p><span class=rvts58>&nbsp;</span><span class=rvts57>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&nbsp;</span></p>
<p><span class=rvts57>(&#1052;&#1053;&#1042;-&#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1075;&#1086; &#1074;&#1074;&#1086;&#1076;&#1072;)</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1042; &#1045;&#1074;&#1088;&#1086;&#1087;&#1077; &#1080; &#1057;&#1064;&#1040; &#1074;&#1077;&#1076;&#1091;&#1090;&#1089;&#1103; &#1080;&#1085;&#1090;&#1077;&#1085;&#1089;&#1080;&#1074;&#1085;&#1099;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1086; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1080; fuzzy-&#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1074; &#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1099; &#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1083;&#1077;&#1088;&#1086;&#1074; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&nbsp;</span><span class=rvts60>(&#1095;&#1080;&#1087;&#1099; Motorola 68HC11.12.21)</span><span class=rvts58>. &#1058;&#1072;&#1082;&#1080;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; &#1082;&#1086;&#1084;&#1087;&#1072;&#1082;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1086;&#1076;&#1072; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1085;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1084; &#1103;&#1076;&#1088;&#1077;.&nbsp;</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1042;&nbsp;</span><span class=rvts60>Siemens Nixdorf</span><span class=rvts58>&nbsp;&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; fuzzy-&#1089;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082;&#1086;&#1085;&#1090;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1073;&#1097;&#1091;&#1102; &#1096;&#1080;&#1085;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1085;&#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1074;&#1086;&#1080; &#1091;&#1089;&#1080;&#1083;&#1080;&#1103; &#1085;&#1072; &#1088;&#1072;&#1079;&#1084;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;/&#1091;&#1087;&#1083;&#1086;&#1090;&#1085;&#1077;&#1085;&#1080;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083; (&#1087;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;&#1099; ).</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1053;&#1077;&#1095;&#1077;&#1090;&#1082;&#1072;&#1103; &#1083;&#1086;&#1075;&#1080;&#1082;&#1072;&nbsp;</span><span class=rvts60>&#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1077;&#1077; &#1080; &#1076;&#1077;&#1096;&#1077;&#1074;&#1083;&#1077;.</span><span class=rvts58>&nbsp;&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1077;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;&nbsp;</span><span class=rvts60>(fuzzy-&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080;)</span><span class=rvts58>&nbsp;&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072; &#1074; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1080;.&nbsp;</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1045;&#1089;&#1083;&#1080; &#1082;&#1072;&#1089;&#1082;&#1072;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; fuzzy-&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080;, &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084;&nbsp;</span><span class=rvts60>&#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077;&#1081;&#1088;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077;&#1081;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080;.</span><span class=rvts58>&nbsp;&#1042;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1101;&#1090;&#1080; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1103; &#1086;&#1073;&#1097;&#1080;&#1084; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1086;&#1084;&nbsp;</span><span class=rvts60>"neuro-fuzzy logic"</span><span class=rvts58>.</span></p>
<p><span class=rvts58><br></span></p>
<p><span class=rvts58>&#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1086;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1086;&#1081; &#1083;&#1086;&#1075;&#1080;&#1082;&#1077;, &#1074;&#1089;&#1077;&#1088;&#1100;&#1077;&#1079; &#1079;&#1072;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1074;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077;. &#1048;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086;&nbsp;</span><span class=rvts60>NASA</span><span class=rvts58>&nbsp;&#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1077;&#1089;&#1083;&#1080; &#1077;&#1097;&#1077; &#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;) &#1085;&#1077;&#1095;&#1077;&#1090;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;&#1084;&#1080; &#1089;&#1090;&#1099;&#1082;&#1086;&#1074;&#1082;&#1080; &#1082;&#1086;&#1089;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1086;&#1074;.</span></p>
<p><a href="10.html"><img border=0 alt="" hspace=1 vspace=1 src="img/img_120.jpg"></a></p>
<p><span class=rvts58><br></span></p>

    
<p><span class=rvts30>---------------------------------------</span></p>
<p><span class=rvts30>© 2021 Косолапов А.А.</span></p>

   </td>
  </tr>
 </table>
</body>
</html>
