<html>
<head>
 <title>Компьютерные системы - High Availability кластерные системы</title>
 <META http-equiv=Content-Type content="text/html; charset=Windows-1251">
 <META name=GENERATOR   content="SunRav BookEditor" >
 <META name=keywords    content="">
 <META name=description content="High Availability кластерные системы">
 <link rel="stylesheet" href="styles.css" type="text/css">
</head>
<body style="background: url(back_50.jpg)">
<!-- Generated by SunRav BookOffice -->
 <table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
   <td valign="top">
    
<p><img border=0 width=572 height=130 alt="" hspace=1 vspace=1 src="img/img_0.jpg"><span class=rvts20> </span></p>

    
<p><span class=rvts43>High Availability &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;</span></p>
<p><span class=rvts45><br></span></p>
<p class=rvps9><span class=rvts45>&#1050;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1082; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074;&#1077;&#1079;&#1076;&#1077;,&nbsp;</span><span class=rvts47>&#1075;&#1076;&#1077;</span><span class=rvts45>&nbsp;</span><span class=rvts47>&#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1103; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1077;&#1090; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1090;&#1088;&#1072;&#1090;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;</span><span class=rvts45>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:&nbsp;</span></p>
<ul style="text-indent: 71px; margin-left: 0px; list-style-position: inside;">
<li class=rvps9><span class=rvts45>&#1073;&#1080;&#1083;&#1083;&#1080;&#1085;&#1075;&#1086;&#1074;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1073;&#1072;&#1085;&#1082;&#1086;&#1074;&#1089;&#1082;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1094;&#1080;&#1103;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1077;&#1084;, &#1080; &#1090;.&#1087;....&nbsp;</span></li>
</ul>
<p class=rvps9><span class=rvts45><br></span></p>
<p class=rvps9><span class=rvts45>&#1057;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1074; &#1084;&#1080;&#1088;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099;&nbsp;</span><span class=rvts47>&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1080;&#1087;&#1086;&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;.&nbsp;</span><span class=rvts45>&#1057;&#1088;&#1077;&#1076;&#1080; &#1085;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1087;&#1083;&#1086;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;&nbsp;</span><span class=rvts47>&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1074;&#1099;&#1089;&#1086;&#1082;&#1080;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1080; &#1089;&#1072;&#1084;&#1086;&#1081; &#1085;&#1080;&#1079;&#1082;&#1086;&#1081; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;.</span><span class=rvts45>&nbsp;&#1054;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1074;&#1089;&#1077;&#1093; &#1078;&#1080;&#1079;&#1085;&#1077;&#1085;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1085;&#1077; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1080; &#1077;&#1076;&#1080;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1086;&#1090;&#1082;&#1072;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1087;&#1086;&#1090;&#1077;&#1088;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1058;&#1072;&#1082;&#1091;&#1102;&nbsp;</span><span class=rvts47>&#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1091; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#8211; NSPF (No Single Point of Failure, - &#1072;&#1085;&#1075;&#1083;., &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1077;&#1076;&#1080;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072;).&nbsp;</span></p>
<p><img border=0 width=608 height=484 alt="" hspace=1 vspace=1 src="img/img_80.jpg"></p>
<p><span class=rvts46>&#1050;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1089; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1090;&#1086;&#1095;&#1077;&#1082; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1074;</span></p>
<p><span class=rvts45><br></span></p>
<p><span class=rvts45><br></span></p>
<p class=rvps9><span class=rvts45>&#1055;&#1088;&#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;,&nbsp;</span><span class=rvts47>&#1075;&#1083;&#1072;&#1074;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1100; - &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1103;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1083;&#1072; &#1074;&#1099;&#1089;&#1086;&#1082;&#1080;&#1084;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1080; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;:&nbsp;</span></p>
<ul style="text-indent: 71px; margin-left: 0px; list-style-position: inside;">
<li class=rvps9><span class=rvts45>&#1095;&#1090;&#1086;&#1073;&#1099; &#1077;&#1077;&nbsp;</span><span class=rvts47>&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1073;&#1099;&#1083;&#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1099;&#1084;&#1080;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1072; &#1073;&#1099;&#1083;&#1072; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1072;&#1103;, &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099;&nbsp;</span><span class=rvts47>&#1085;&#1077; &#1080;&#1084;&#1077;&#1083;&#1072; &#1090;&#1086;&#1095;&#1077;&#1082; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1074;</span><span class=rvts45>&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1076;&#1086;&#1073;&#1085;&#1072; &#1074;&nbsp;</span><span class=rvts49>&#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1083;&#1072; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072;&#1084;&#1077;&#1085;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1073;&#1077;&#1079; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1072;&nbsp;</span></li>
</ul>
<p class=rvps9><span class=rvts45>&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086; &#1087;&#1088;&#1086;&#1081;&#1076;&#1077;&#1084;&#1089;&#1103; &#1087;&#1086; &#1074;&#1089;&#1077;&#1084; &#1090;&#1088;&#1105;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1084;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1063;&#1090;&#1086; &#1082;&#1072;&#1089;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1090;&#1086; &#1086;&#1085;&#1072; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1080; &#1089;&#1074;&#1077;&#1088;&#1093;&#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1077;&#1078;&#1080;&#1084;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1090;&#1077;&#1087;&#1083;&#1086;&#1074;&#1099;&#1093;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1054;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; (ECC, Chip Kill &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1099;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080; &#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;, &#1080; &#1090;.&#1087;.), &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. &#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1072;&#1103; &#1089;&#1093;&#1077;&#1084;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1080; &#1086;&#1090;&#1082;&#1072;&#1079;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1087;&#1077;&#1088;&#1077;&#1088;&#1072;&#1089;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1091;&#1079;&#1083;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1102;&#1090; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1085;&#1086;. &#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1073;&#1086;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1090;&#1082;&#1072;&#1079;&#1086;&#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1085;&#1091;&#1078;&#1085;&#1072; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1076;&#1083;&#1103; &#1084;&#1080;&#1085;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1074;&#1085;&#1077;&#1087;&#1083;&#1072;&#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1103;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1052;&#1085;&#1086;&#1075;&#1086; &#1082;&#1090;&#1086; &#1079;&#1072;&#1073;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074;&#1086; &#1074; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1080;&#1102; &#1087;&#1083;&#1072;&#1085;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077;&#1074; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; &#1074;&#1099;&#1096;&#1077;&#1076;&#1096;&#1077;&#1075;&#1086; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1103; &#1086;&#1073;&#1086;&#1088;&#1091;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;) &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1048; &#1077;&#1089;&#1083;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1073;&#1077;&#1079; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1072;, &#1090;&#1086; &#1077;&#1077; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103;.&nbsp;</span></p>
<p><a href="790.html"><img border=0 alt="" hspace=1 vspace=1 src="img/img_81.jpg"></a></p>

    
<p><span class=rvts30>---------------------------------------</span></p>
<p><span class=rvts30>© 2021 Косолапов А.А.</span></p>

   </td>
  </tr>
 </table>
</body>
</html>
