<html>
<head>
 <title>Компьютерные системы - High Performance кластеры</title>
 <META http-equiv=Content-Type content="text/html; charset=Windows-1251">
 <META name=GENERATOR   content="SunRav BookEditor" >
 <META name=keywords    content="">
 <META name=description content="High Performance кластеры">
 <link rel="stylesheet" href="styles.css" type="text/css">
</head>
<body style="background: url(back_49.jpg)">
<!-- Generated by SunRav BookOffice -->
 <table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
   <td valign="top">
    
<p><img border=0 width=572 height=130 alt="" hspace=1 vspace=1 src="img/img_0.jpg"><span class=rvts20> </span></p>

    
<p><span class=rvts43>High Performance &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1099;</span></p>
<p class=rvps9><span class=rvts44><br></span></p>
<p class=rvps9><span class=rvts45>&#1042;&#1099;&#1089;&#1086;&#1082;&#1086;&#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;:&nbsp;</span></p>
<ul style="text-indent: 71px; margin-left: 0px; list-style-position: inside;">
<li class=rvps9><span class=rvts45>&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;: &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1085;&#1072;&#1091;&#1095;&#1085;&#1099;&#1077; &#1080;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: &#1092;&#1080;&#1079;&#1080;&#1082;&#1072;, &#1073;&#1080;&#1086;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1082;&#1072;, &#1073;&#1080;&#1086;&#1093;&#1080;&#1084;&#1080;&#1103;, &#1073;&#1080;&#1086;&#1092;&#1080;&#1079;&#1080;&#1082;&#1072;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; (&#1075;&#1077;&#1086;&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;, &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;)&nbsp;</span></li>
</ul>
<p class=rvps9><span class=rvts45>&#1080; &#1084;&#1085;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;&#8230;</span></p>
<p class=rvps9><span class=rvts45>&#1055;&#1086;&#1095;&#1090;&#1080; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1077; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1073;&#1077;&#1075;&#1085;&#1091;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1090; &#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;,&nbsp;</span><span class=rvts47>&#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; High Performance &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1091;&#1079;&#1083;&#1086;&#1074; &#1080; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080;.</span><span class=rvts45>&nbsp;</span></p>
<p class=rvps9><img border=0 width=689 height=361 alt="" hspace=1 vspace=1 src="img/img_78.jpg"></p>
<p class=rvps9><span class=rvts46>&#1042;&#1099;&#1089;&#1086;&#1082;&#1086;&#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1085;&#1086;&#1081; &nbsp;&#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;</span></p>
<p class=rvps9><span class=rvts45>&#1055;&#1088;&#1080;&#1095;&#1077;&#1084; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1101;&#1090;&#1080;&#1093; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081; &#1085;&#1072; &#1086;&#1073;&#1097;&#1091;&#1102; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1089; &#1087;&#1086;&#1076;&#1079;&#1072;&#1076;&#1072;&#1095;&#1072;&#1084;&#1080;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1102; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1095;&#1077;&#1084; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1102;, &#1090;&#1077;&#1084; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1077;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1063;&#1090;&#1086; &#1076;&#1080;&#1082;&#1090;&#1091;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095;.&nbsp;</span></p>
<p class=rvps9><span class=rvts47>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;</span><span class=rvts45>&nbsp;&#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1076;&#1079;&#1072;&#1076;&#1072;&#1095;&#1072;&#1084;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1090; &#1074; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1090;&#1077;&#1084;, &#1095;&#1090;&#1086;&nbsp;</span><span class=rvts49>&#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1077;&#1078;&#1076;&#1091; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1084; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; &#1091;&#1079;&#1083;&#1072; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1077;&#1090; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1085;&#1099;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1084;&#1077;&#1078;&#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;.</span><span class=rvts45>&nbsp;&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1087;&#1088;&#1080;&#1074;&#1099;&#1095;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1084; SMP &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1084;&#1080;,&nbsp;</span><span class=rvts49>&#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1074; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1080; &#1082;&#1101;&#1096; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1080; &#1084;&#1077;&#1078;&#1091;&#1079;&#1083;&#1086;&#1074;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1081;.&nbsp;</span></p>
<p class=rvps3><span class=rvts45>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts47>&#1041;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1074;&#1091;&#1084;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080;: &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1085;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1076;&#1072;&#1085;&#1099;&#1093; &#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089;&#1072;&#1084;&#1099;&#1093; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1093; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;.</span><span class=rvts45>&nbsp;&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1081; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074; &nbsp;&#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;.&nbsp;</span></p>
<p><a href="760.html"><img border=0 alt="" hspace=1 vspace=1 src="img/img_79.jpg"></a><span class=rvts44>&nbsp;</span></p>
<p><span class=rvts48><br></span></p>

    
<p><span class=rvts30>---------------------------------------</span></p>
<p><span class=rvts30>© 2021 Косолапов А.А.</span></p>

   </td>
  </tr>
 </table>
</body>
</html>
