<html>
<head>
 <title>Компьютерные системы - Проблемы связи процессоров в кластерной системе</title>
 <META http-equiv=Content-Type content="text/html; charset=Windows-1251">
 <META name=GENERATOR   content="SunRav BookEditor" >
 <META name=keywords    content="">
 <META name=description content="Проблемы связи процессоров в кластерной системе">
 <link rel="stylesheet" href="styles.css" type="text/css">
</head>
<body style="background: url(back_52.jpg)">
<!-- Generated by SunRav BookOffice -->
 <table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
   <td valign="top">
    
<p><img border=0 width=572 height=130 alt="" hspace=1 vspace=1 src="img/img_0.jpg"><span class=rvts20> </span></p>

    
<p><span class=rvts43>&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089;&#1074;&#1103;&#1079;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1074; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;</span></p>
<p><span class=rvts45><br></span></p>
<p class=rvps9><span class=rvts51>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (</span><span class=rvts53>&#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;</span><span class=rvts51>) &#1074;&nbsp;</span><span class=rvts53>&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1081; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1077;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;</span><span class=rvts51>, &#1095;&#1077;&#1084; &#1090;&#1080;&#1087; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1074; &#1085;&#1077;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;. &#1050;&#1088;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;, &#1074;&#1083;&#1080;&#1103;&#1102;&#1097;&#1080;&#1084; &#1085;&#1072; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1084;&#1080;. &#1058;&#1072;&#1082;, &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1074; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; 10 &#1087;&#1077;&#1088;&#1089;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1074; &#1085;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072; &#1074; 10 &#1088;&#1072;&#1079; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1074; &#1094;&#1077;&#1083;&#1086;&#1084; &#1074; 10 &#1088;&#1072;&#1079; &#1085;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1089;&#1103;.&nbsp;&nbsp;</span></p>
<p class=rvps9><span class=rvts51><br></span></p>
<p class=rvps9><span class=rvts51>&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&nbsp;</span><span class=rvts53>&#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; 16-&#1090;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099; &#1073;&#1099;&#1083;&#1080; &#1073;&#1099; &#1088;&#1072;&#1074;&#1085;&#1086;&#1087;&#1088;&#1072;&#1074;&#1085;&#1099;.</span><span class=rvts51>&nbsp;&#1053;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077;&nbsp;</span><span class=rvts53>&#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1081; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080;</span><span class=rvts51>, &#1075;&#1076;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1094;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;.&nbsp;&nbsp;</span></p>
<p><span class=rvts46><br></span></p>
<p><img border=0 width=512 height=503 alt="" hspace=1 vspace=1 src="img/img_84.jpg"></p>
<p><span class=rvts46>&#1057;&#1093;&#1077;&#1084;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1081; &#1088;&#1077;&#1096;&#1077;&#1090;&#1082;&#1080;&nbsp;</span></p>
<p><span class=rvts46><br></span></p>
<p class=rvps9><span class=rvts51>&#1055;&#1088;&#1080; &#1090;&#1072;&#1082;&#1086;&#1084; &#1090;&#1080;&#1087;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1084;&#1080; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; 6 (&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1074;&#1103;&#1079;&#1077;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1084;&#1080;, &#1086;&#1090;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1089;&#1072;&#1084;&#1099;&#1081; &#1073;&#1083;&#1080;&#1078;&#1085;&#1080;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088; &#1086;&#1090; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1075;&#1086;, &#1055;&#1054; &#1044;&#1048;&#1040;&#1043;&#1054;&#1053;&#1040;&#1051;&#1048;!).&nbsp;</span><span class=rvts55>&#1058;&#1077;&#1086;&#1088;&#1080;&#1103; &#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1072;&#1084;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 4, &#1090;&#1086;</span><span class=rvts54>&nbsp;&#1090;&#1072;&#1082;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;.</span><span class=rvts51>&nbsp;&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1087;&#1088;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1080; 16 &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1076;&#1088;&#1091;&#1075; &#1089; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1087;&#1083;&#1086;&#1089;&#1082;&#1072;&#1103; &#1089;&#1093;&#1077;&#1084;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;. &#1044;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1084;&#1087;&#1072;&#1082;&#1090;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100;&nbsp;</span><span class=rvts55>&#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1086; &#1085;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1077;&#1081; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1084; &#1087;&#1088;&#1080; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1080; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;.</span><span class=rvts51>&nbsp;</span></p>
<p class=rvps9><span class=rvts51><br></span></p>
<p class=rvps9><span class=rvts53>&#1042; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1090;&#1072;&#1082;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1072;&#1088;.</span><span class=rvts51>&nbsp;&#1053;&#1086; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1085;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1091;&#1079;&#1083;&#1086;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091;, &#1090;&#1086; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1096;&#1072;&#1088;&#1072; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;</span><span class=rvts53>&nbsp;&#1082;&#1091;&#1073; (&#1077;&#1089;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1088;&#1072;&#1074;&#1085;&#1086; 8)</span><span class=rvts51>&nbsp;&#1080;&#1083;&#1080;&nbsp;</span><span class=rvts53>&#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;</span><span class=rvts51>, &#1077;&#1089;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 8. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100;. &#1058;&#1072;&#1082;,&nbsp;</span><span class=rvts56>&#1076;&#1083;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; 16 &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; 4-&#1093; &#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;</span><span class=rvts51>. &#1044;&#1083;&#1103; &#1077;&#1075;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1079;&#1103;&#1090;&#1100; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; 3-&#1093; &#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1082;&#1091;&#1073;, &#1089;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1100; &#1074; &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1080;, &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1074; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1099;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 4.</span></p>
<p><img border=0 width=465 height=397 alt="" hspace=1 vspace=1 src="img/img_85.jpg"></p>
<p><span class=rvts52>&#1058;&#1088;&#1105;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;</span></p>
<p><span class=rvts51><br></span></p>
<p><img border=0 width=797 height=418 alt="" hspace=1 vspace=1 src="img/img_86.jpg"></p>
<p><span class=rvts52>4-&#1093; &nbsp;&#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;</span></p>
<p><span class=rvts52><br></span></p>
<p class=rvps9><span class=rvts45>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1082;&#1091;&#1073;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;&nbsp;</span><span class=rvts47>&#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080;</span><span class=rvts45>, &#1085;&#1086; &#1089;&#1072;&#1084;&#1086;&#1081; &#1085;&#1072;&#1075;&#1083;&#1103;&#1076;&#1085;&#1086;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1089;&#1077;&#1090;&#1077;&#1081; &#1089;&#1074;&#1103;&#1079;&#1080;:&nbsp;</span></p>
<ul style="text-indent: 0px; margin-left: 24px; list-style-position: outside;">
<li class=rvps9><span class=rvts45>&#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1099;&#1081; &#1090;&#1086;&#1088;,&nbsp;</span></li>
<li class=rvps9><span class=rvts45>"&#1082;&#1086;&#1083;&#1100;&#1094;&#1086;",&nbsp;</span></li>
<li class=rvps9><span class=rvts45>"&#1079;&#1074;&#1077;&#1079;&#1076;&#1072;"&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;.</span></li>
</ul>
<p class=rvps9><span class=rvts52>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; &#1089; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1100;&#1102; &#1087;&#1086; &#1093;&#1086;&#1088;&#1076;&#1072;&#1084; (Chordal Ring)</span></p>
<p><img border=0 width=479 height=475 alt="" hspace=1 vspace=1 src="img/img_87.jpg"></p>
<p class=rvps9><span class=rvts51><br></span></p>
<p class=rvps9><span class=rvts55>&#1053;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1089; &#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1075;&#1080;&#1077;&#1081; "&#1090;&#1086;&#1083;&#1089;&#1090;&#1086;&#1075;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;" (fat-tree).</span><span class=rvts51>&nbsp;&#1055;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1051;&#1077;&#1081;&#1079;&#1077;&#1088;&#1089;&#1086;&#1085;&#1086;&#1084; (Charles E. Leiserson) &#1074; 1985 &#1075;&#1086;&#1076;&#1091;.&nbsp;</span></p>
<p class=rvps9><span class=rvts51>&#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099; &#1083;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1083;&#1080;&#1089;&#1090;&#1100;&#1103;&#1093; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;, &#1074; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1091;&#1079;&#1083;&#1099; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1089;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1089;&#1077;&#1090;&#1100;. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1077;&#1074;&#1100;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1073;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1085;&#1077; &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1099;&#1089;&#1086;&#1082;&#1080;&#1093; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081; &#1089;&#1077;&#1090;&#1080;.&nbsp;</span></p>
<p class=rvps14><img border=0 width=588 height=234 alt="" hspace=1 vspace=1 src="img/img_88.jpg"></p>
<p><span class=rvts57>&#1050;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#171;Fat-tree&#187;</span></p>
<p class=rvps9><img border=0 alt="" hspace=1 vspace=1 src="img/img_89.jpg"></p>
<p><span class=rvts57>&#1050;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#171;Fat-tree&#187;</span></p>
<p><span class=rvts57>(&#1074;&#1080;&#1076; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1091;&#1102; &#1089;&#1093;&#1077;&#1084;&#1091;)</span></p>
<p class=rvps9><span class=rvts51><br></span></p>
<p class=rvps13><span class=rvts45>&nbsp;&#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1083;&#1103; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &nbsp;&#1082;&#1083;&#1072;&#1089;&#1090;&#1082;&#1087;&#1077;&#1099;&#1093; &#1050;&#1057; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1072;&nbsp;</span><span class=rvts43>&#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</span><span class=rvts45>&nbsp;&#1069;&#1090;&#1072; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1091; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.&nbsp;</span></p>
<p class=rvps13><span class=rvts45><br></span></p>
<p class=rvps13><span class=rvts45>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1090;&#1088;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1072; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;:&nbsp;</span></p>
<ul style="text-indent: 71px; margin-left: 0px; list-style-position: inside;">
<li class=rvps9><span class=rvts47>&#1057;&#1080;&#1084;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1085;&#1072;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1072;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1089; &#1086;&#1073;&#1097;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100;&#1102; (Shared Memory SMP Architecture).</span><span class=rvts45>&nbsp;&#1069;&#1090;&#1072; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1077;&#1076;&#1080;&#1085;&#1091;&#1102; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1091;&#1102; &#1085;&#1072; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1084; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077; &#1087;&#1086;&#1076; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1059;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1088;&#1072;&#1097;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.&nbsp;</span></li>
<li class=rvps9><span class=rvts47>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1089; &#1086;&#1073;&#1097;&#1080;&#1084;&#1080; (&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084;&#1080;) &#1076;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080; (Shared Disk Architecture).</span><span class=rvts45>&nbsp;</span></li>
</ul>
<p><img border=0 width=525 height=581 alt="" hspace=1 vspace=1 src="img/img_90.jpg"></p>
<p class=rvps9><span class=rvts45>&#1069;&#1090;&#1086; &#1090;&#1080;&#1087;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1069;&#1090;&#1072; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1077;&#1076;&#1080;&#1085;&#1091;&#1102; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088; (&#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1091;&#1079;&#1083;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072;), &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1087;&#1086;&#1076; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1074;&#1086;&#1077;&#1081; &#1082;&#1086;&#1087;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1042; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1074;&#1089;&#1077; &#1091;&#1079;&#1083;&#1099; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1073;&#1097;&#1080;&#1084; &#1076;&#1080;&#1089;&#1082;&#1072;&#1084;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1072;&#1103; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1091;&#1090;&#1077;&#1084; &#1085;&#1072;&#1088;&#1072;&#1097;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074; &#1080; &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1091;&#1079;&#1083;&#1077; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1089;&#1072;&#1084;&#1080;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074;.&nbsp;</span></p>
<ul style="text-indent: 71px; margin-left: 0px; list-style-position: inside;">
<li class=rvps9><span class=rvts47>&#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1073;&#1077;&#1079; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; (Shared Nothing Architecture).</span><span class=rvts45>&nbsp;</span></li>
</ul>
<p class=rvps9><img border=0 width=484 height=509 alt="" hspace=1 vspace=1 src="img/img_91.jpg"></p>
<p class=rvps9><span class=rvts45>&#1050;&#1072;&#1082; &#1080; &#1074; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077; &#1089; &#1086;&#1073;&#1097;&#1080;&#1084;&#1080; &#1076;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080;, &#1074; &#1101;&#1090;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1079; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1084;&#1080;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1084;&#1080; &#1087;&#1086;&#1076; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1074;&#1086;&#1080;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074; &#1101;&#1090;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1091;&#1102; &#1087;&#1072;&#1084;&#1103;&#1090;&#1100; &#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1080;&#1089;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1091;&#1079;&#1083;&#1072;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&nbsp;</span><span class=rvts47>&#1074; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1097;&#1080;&#1081; &#1082;&#1086;&#1084;&#1084;&#1091;&#1085;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1082;&#1072;&#1085;&#1072;&#1083; &#1084;&#1077;&#1078;&#1076;&#1091; &#1091;&#1079;&#1083;&#1072;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</span><span class=rvts45>&nbsp;&#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081; (&#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1081;) &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1091;&#1079;&#1083;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1091;&#1090;&#1077;&#1084; &#1085;&#1072;&#1088;&#1072;&#1097;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;,&nbsp;</span><span class=rvts47>&#1089;&#1088;&#1077;&#1076;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1076;&#1074;&#1091;&#1084;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;:</span><span class=rvts45>&nbsp;</span></p>
<ul style="text-indent: 0px; margin-left: 24px; list-style-position: outside;">
<li class=rvps9><span class=rvts45>&#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;&nbsp;</span></li>
<li class=rvps9><span class=rvts45>&#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;.&nbsp;</span></li>
</ul>
<p class=rvps9><span class=rvts45>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1085;&#1086;&#1081; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074; &#1080;&#1083;&#1080; &#1091;&#1079;&#1083;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1089; &#1077;&#1076;&#1080;&#1085;&#1086;&#1081; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1090;&#1072;&#1082;&#1080;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074;, &#1086;&#1089;&#1090;&#1072;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1091;&#1079;&#1083;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1079;&#1103;&#1090;&#1100; &#1085;&#1072; &#1089;&#1077;&#1073;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1085;&#1072; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072;&#1074;&#1096;&#1077;&#1084; &#1091;&#1079;&#1083;&#1077;, &#1085;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1103; &#1086;&#1073;&#1097;&#1080;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1091;&#1079;&#1083;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1079; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1082;&#1088;&#1072;&#1081;&#1085;&#1077;&#1081; &#1084;&#1077;&#1088;&#1077; &#1086;&#1076;&#1080;&#1085; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1085;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083;. &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1083;&#1077;&#1075;&#1082;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1090;.&#1077;. &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;, &#1086;&#1073;&#1098;&#1077;&#1084;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1080; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1080; &#1085;&#1086;&#1074;&#1099;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1083;&#1102;&#1073;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;.&nbsp;</span></p>
<p class=rvps9><span class=rvts45>&#1055;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&nbsp;</span><span class=rvts47>&#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; on-line, &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093;</span><span class=rvts45>&nbsp;&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081; &#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1082;&#1088;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1081; &#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1101;&#1082;&#1089;&#1087;&#1083;&#1091;&#1072;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; 24 &#1095;&#1072;&#1089;&#1072; &#1074; &#1089;&#1091;&#1090;&#1082;&#1080;</span></p>
<p><a href="1160.html"><img border=0 alt="" hspace=1 vspace=1 src="img/img_92.jpg"></a></p>
<p><span class=rvts50><br></span></p>

    
<p><span class=rvts30>---------------------------------------</span></p>
<p><span class=rvts30>© 2021 Косолапов А.А.</span></p>

   </td>
  </tr>
 </table>
</body>
</html>
